//=============================================================================
//
// ダイナマイト処理 [bom.h]
// Author : 熊澤義弘
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define BOM_H_MAX			(100.0f)		// ダイナマイトの高さ
#define BOM_H				(45.0f)		// ダイナマイトの高さ

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct BOM
{
	XMFLOAT4X4			mtxWorld;			// ワールドマトリックス
	XMFLOAT3			pos;				// モデルの位置
	XMFLOAT3			rot;				// モデルの向き(回転)
	XMFLOAT3			scl;				// モデルの大きさ(スケール)

	BOOL				use;
	BOOL				load;
	DX11_MODEL			model;				// モデル情報
	XMFLOAT4			diffuse[MODEL_MAX_MATERIAL];	// モデルの色

	float				speed;				// 移動スピード
	float				time;				// 時間
	
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBom(void);
void UninitBom(void);
void UpdateBom(void);
void DrawBom(void);

BOM *GetBom(void);

void SetBom(void);
BOOL GetBomUse(void);
float GetBomTime(void);
int GetCoolTime(void);
