//=============================================================================
//
// 木の処理 [tree.h]
// Author : 熊澤義弘
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_FOBJ		(20)					// オブジェクトの数
#define MAX_FOBJ_GUAD	(55)					// オブジェクトの数
#define MAX_FOBJ_SIGN	(5)						// オブジェクトの数


//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct FOBJ
{
	XMFLOAT4X4			mtxWorld;			// ワールドマトリックス
	XMFLOAT3			pos;				// モデルの位置
	XMFLOAT3			rot;				// モデルの向き(回転)
	XMFLOAT3			scl;				// モデルの大きさ(スケール)

	BOOL				use;
	BOOL				load;
	DX11_MODEL			model;				// モデル情報
	XMFLOAT4			diffuse[MODEL_MAX_MATERIAL];	// モデルの色
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTree(void);
void UninitTree(void);
void UpdateTree(void);
void DrawTree(void);

FOBJ *GetBilding(void);

